Tekla Open API Reference for Tekla Structures 2025
SaveLoad.HelpKeyword Property
 Gets or sets the HelpKeyword that the help file should be opened for. If you do not provide a HelpKeyword and HelpUrl is not set, the default start page for Tekla Structures Help viewer is displayed.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string HelpKeyword { get; set; }
Public Property HelpKeyword As String
	Get
	Set
Property Value
Type: String
Examples
 If you would like to show for example the topic in the following location: "C:\MyApp\Sample.chm::/SubBook.chm::/MainPage.htm", the HelpKeyword would be "SubBook.chm::/MainPage.htm". If you are using the HelpProvider class to provide pop-up or online help for controls, you can get the keyword by calling HelpProvider1.GetHelpKeyword(this). If you would like to use Tekla Structures Help Viewer, you can do so by specifying HelpKeyword as "Filename" without extension and not setting the HelpUrl.
See Also
Reference
SaveLoad Class
Tekla.Structures.Dialog.UIControls Namespace